IDEA Connection Link
ConnectionLink.GetProtocolArchiveForProject Method
 Gets the filename of the temporary ZIP archive which includes the protocol of the check of the connection. If the protocol doesn't exist CBFEM analysis is executed and protocol is generated.
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public string GetProtocolArchiveForProject(
	string fileName
)
Public Function GetProtocolArchiveForProject (
	fileName As String
) As String
public:
String^ GetProtocolArchiveForProject(
	String^ fileName
)
Parameters
fileName
Type: System.String
[Missing <param name="fileName"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.GetProtocolArchiveForProject(System.String)"]
Return Value
Type: String
File name of the zip archive or null
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace